app/controllers/posters_controller.rb

SELECT * FROM "posters"
---
  def index
    @posters = Poster.all.reverse

SELECT * FROM "posters" WHERE ("posters"."id" = 0)
---
  def show
    @poster = Poster.find(params[:id])

SELECT * FROM "posters" WHERE ("posters"."id" = 35)
---
  def edit
    @poster = Poster.find(params[:id])

SELECT * FROM "posters" WHERE ("posters"."id" = 1)
---
  def destroy
    @poster = Poster.find(params[:id])

INSERT INTO "posters" ("result", "created_at", "code", "updated_at", "mode", "user", "query") VALUES('http://twitter.com/SoHtheband/statuses/35372294045962240, http://twitter.com/necome_00/statuses/35372294041772032, http://twitter.com/criisalvernaz/statuses/35372293911740416, http://twitter.com/Diabetic_DoNUTZ/statuses/35372293895110656, http://twitter.com/AmanKayo_Shoota/statuses/35372293525868544, http://twitter.com/MaridaDoPeLu/statuses/35372293446180864, http://twitter.com/Ohhjasminnee/statuses/35372293274353664, http://twitter.com/FC_FamRestart/statuses/35372293240659968, http://twitter.com/lethiciasl_/statuses/35372293123211264, http://twitter.com/joeriholzken/statuses/35372293060440064, http://twitter.com/ditocokin/statuses/35372292838133760, http://twitter.com/visadklline/statuses/35372292825423872, http://twitter.com/dayaner_/statuses/35372292775088128, http://twitter.com/Anakrutsch/statuses/35372292632621056, http://twitter.com/gabifrugoli/statuses/35372292561174529', '2011-02-09 16:20:07', 200, '2011-02-09 16:20:07', 'Web', NULL, 'twitter facebook')
---
  def format
    if params[:q]
      @key = URI.decode params[:q]
      mode = params[:mode]
      @poster = Poster.new
      @poster.query = params[:q]

      @poster.mode = 'Web'

      result= nil
      url = "search.twitter.com"

      Net::HTTP.start(url) { |http|
        response = http.get('/search.atom' +
            URI.encode('?q=' + @key)  + "&locale=ja&rpp=30",
          "User-Agent" => "Ruby/#{RUBY_VERSION}")
        @poster.code = response.code.to_s
        if response.code == '200'
          result = REXML::Document.new(response.body)
          @items = []
          result.elements.each("feed/entry"){ |e|
            entry = Entry.new
            entry.author = e.elements['author/name'].text.split(' ').first
            entry.authorurl = e.elements['author/uri'].text
            entry.url =  e.elements['link'].attributes["href"]
            entry.date = e.elements['updated'].text
            entry.content = e.elements['content'].text
            entry.image = REXML::XPath.first(e, "link[2]/attribute::href").value
            @items << entry
            @poster.entries << entry

UPDATE "posters" SET "updated_at" = '2011-02-14 14:58:41', "mode" = 'PDF' WHERE "id" = 40
SELECT * FROM "posters" WHERE ("posters"."id" = 40)
---
          @poster.result = ""
        end
      }
      @poster.save
    elsif  params[:id]
      @poster = Poster.find(params[:id])